//
//  WXYZ_BookMallStyleMixtureTableViewCell.h
//  WXReader
//
//  Created by Andrew on 2018/5/20.
//  Copyright © 2018年 Andrew. All rights reserved.
//

/*
  横三竖三排布方式
 ┌──────────────┐   ┌──────────────┐   ┌──────────────┐
 │              │   │              │   │              │
 │              │   │              │   │              │
 │              │   │              │   │              │
 │     photo    │   │     photo    │   │     photo    │
 │              │   │              │   │              │
 │              │   │              │   │              │
 │              │   │              │   │              │
 └──────────────┘   └──────────────┘   └──────────────┘
 ┌──────────────┐   ┌──────────────┐   ┌──────────────┐
 │   book Name  │   │   book Name  │   │   book Name  │
 └──────────────┘   └──────────────┘   └──────────────┘
 
 ┌──────────────┐  ┌──────────────────────────────────┐
 │              │  │              book Name           │
 │              │  └──────────────────────────────────┘
 │              │  ┌──────────────────────────────────┐
 │     photo    │  │                                  │
 │              │  │              describe            │
 │              │  │                                  │
 │              │  │                                  │
 └──────────────┘  └──────────────────────────────────┘
 ┌──────────────┐  ┌──────────────────────────────────┐
 │              │  │              book Name           │
 │              │  └──────────────────────────────────┘
 │              │  ┌──────────────────────────────────┐
 │     photo    │  │                                  │
 │              │  │              describe            │
 │              │  │                                  │
 │              │  │                                  │
 └──────────────┘  └──────────────────────────────────┘
 ┌──────────────┐  ┌──────────────────────────────────┐
 │              │  │              book Name           │
 │              │  └──────────────────────────────────┘
 │              │  ┌──────────────────────────────────┐
 │     photo    │  │                                  │
 │              │  │              describe            │
 │              │  │                                  │
 │              │  │                                  │
 └──────────────┘  └──────────────────────────────────┘
*/

#import "WXYZ_BookMallBasicStyleTableViewCell.h"

@interface WXYZ_BookMallStyleMixtureTableViewCell : WXYZ_BookMallBasicStyleTableViewCell <UICollectionViewDelegate, UICollectionViewDataSource>

@end
